app/controllers/welcome_controller.rb

  def index
    @fase_1_1 = 5.times.map
    @fase_1_2 = 5.times.map

    @moedas_totais = CollectedCoin.where("user_id = "+session[:id_user].to_s).count
    @bowser_total = KilledMonster.where("user_id = "+session[:id_user].to_s+" AND monster_id = 2").count(:monster_id)
    @turtle_total = KilledMonster.where("user_id = "+session[:id_user].to_s+" AND monster_id = 1").count(:monster_id)
    @mortes_totais = Death.where("user_id = "+session[:id_user].to_s).count
---
SELECT COUNT(*) FROM `collected_coins` WHERE (user_id = 4)
SELECT COUNT(`killed_monsters`.`monster_id`) FROM `killed_monsters` WHERE (user_id = 4 AND monster_id = 2)
SELECT COUNT(`killed_monsters`.`monster_id`) FROM `killed_monsters` WHERE (user_id = 4 AND monster_id = 1)
SELECT COUNT(*) FROM `deaths` WHERE (user_id = 4)

  def moeda
    @moeda = CollectedCoin.new(create_moeda_params)

    @moeda.user_id = User.last.id
    @moeda.value = 10

    if @moeda.save
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 1
INSERT INTO `collected_coins` (`user_id`, `value`) VALUES (10, 10)

  def monstro
    @monstro = KilledMonster.new(create_monster_params)
    @monstro.user_id = User.last.id

    @nome_monstro = params[:monster]
    @monstro_clicado = Monster.find_by_name(@nome_monstro)

    if @nome_monstro == @monstro_clicado.name
      @monstro.monster_id = @monstro_clicado.id
    else
      @monstro.monster_id = @monstro_clicado.id
    end

    if @monstro.save
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 1
SELECT  `monsters`.* FROM `monsters` WHERE `monsters`.`name` = 'turtle' LIMIT 1
INSERT INTO `killed_monsters` (`user_id`, `monster_id`) VALUES (10, 1)

  def morte
    @death = Death.new(create_death_params)

    @death.user_id = User.last.id

    if @death.save
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 1
INSERT INTO `deaths` (`user_id`, `created_at`, `updated_at`) VALUES (10, '2019-09-26 06:42:29', '2019-09-26 06:42:29')